#მომხმარებელს შემოატანინეთ ხუთი რიცხვი და ყველა შეიტანეთ 
#სიაში. თქვენი დავალებაა, რომ დაბეჭდოთ ამ სიის ჯამი, არ გამოიყენოთ sum მეთოდი.

# num = []
# for i in range(5):
#     num1 = int(input("enter number:"))
#     num.append(num1)

# num2 = 0
# for num3 in num:
#     num2 += num3
# print(num2)

#სიაში შეიტანეთ თქვენთვის სასურველი 10 რიცხვი. დაბეჭდეთ ამ
# სიაში არსებული ყველაზე დიდი რიცხვი, მინიშნება: გამოიყენეთ for ციკლი. არ გამოიყენოთ max მეთოდი.

# num = []
# for i in range(10):
#     num2 = int(input("enter number:"))
#     num.append(num2)

# num3 = num[0]
# for num4 in num:
#     if num4 > num3:
#         num3=num4
# print(num3)


#სიაში შეიტანეთ 30-იდან 50-ის ჩათვლით არსებული ყველა რიცხვი.
# შემდეგ დაითვალეთ ამ სიაში არსებული კენტი რიცხვები და დაბეჭდეთ მათი რაოდენობა.



# numbers = list(range(30,51))
# odd = 0
# for num in numbers:
#     if num % 2 !=0:
#         odd += 1
# print(odd)



#სიაში შეიტანეთ 10-იდან 50-ის ჩათვლით არსებული 4-ის ჯერადი რიცხვები.
# შემდეგ შეაბრუნეთ ეს სია და დაბეჭდეთ ის, test case: [1, 2, 3, 4, 5] -> [5, 4, 3, 2, 1]

#list1 =list(range(10,51,4))
#print(list1)


#თქვენი დავალებაა, რომ სიაში შეიტანოთ 50-იდან 100-მდე არსებული ყველა რიცხვი.
# შემდეგ გამოიყენეთ for ციკლი და დაბეჭდეთ ყველა ლუწი რიცხვი  მათი ინდექსებით.
# test case: ["50 - 0", "52 - 3", "54 - 5", "56 - 7"]


for num in range(50,101,2):
 print(f"{num} - {(num - 50) // 2}", end=", ")

